app/services/orders/amount_calculator.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 4
SELECT "pizza_sizes".* FROM "pizza_sizes" WHERE "pizza_sizes"."id" IN (6, 5, 4)
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" IN (4, 6)
---
    def initialize(order)
      @order = order
      @order_items = order.order_items.includes(:pizza, :pizza_size)

SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" IN (4, 6)
---
    def fetch_promotion_items(promotion)
      order_items.select{|order_item| order_item.pizza.name == promotion.target && order_item.pizza_size.name == promotion.target_size && order_item.promotion_item != true}