app/views/orders/_order.html.erb

SELECT "orders".* FROM "orders"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 1
---
      <ul>
        <% order.order_items.each do |item| %>