app/controllers/orders_controller.rb

  def index
    @orders = Order.where(state: 'OPEN')
---
SELECT "orders".* FROM "orders" WHERE "orders"."state" = 'OPEN'

  def update
    respond_to do |format|
      if @order.update(state: 'COMPLETED')
---
UPDATE "orders" SET "state" = 'COMPLETED', "updated_at" = '2024-11-21 22:31:14.114447' WHERE "orders"."id" = 4

  def set_order
    @order = Order.find(params.expect(:id))
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 4 LIMIT 1