app/models/order_item.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."name" IN ('Onions', 'Cheese', 'Olives')
SELECT SUM("ingredients"."multiplier") FROM "ingredients" WHERE "ingredients"."name" IN ('Onions', 'Cheese', 'Olives')
---
  def add_on_price
    ingredents = Ingredient.where(name: add)
    ingredents.map{|ingredent| ingredent.multiplier * pizza_size.multiplier}.sum